ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_atim3.h
/**
 *******************************************************************************
 * @file  atim3.h
 * @brief This file contains all the functions prototypes of the ATIM3 driver
 *        library
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-18       MADS            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

#ifndef __ATIM3_H__
#define __ATIM3_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l021_ddl.h"

/**
 * @addtogroup HC32L021_DDL 驱动库
 * @{
 */

/**
 * @addtogroup DDL_ATIM3 ATIM3模块驱动库
 * @{
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE0_Global_Types ATIM3 Mode0全局类型定义
 * @{
 */

/**
 * @brief ATIM3 mode0 配置结构体定义(模式0)
 */
typedef struct
{
    uint32_t u32WorkMode;         /*!< 工作模式设置 @ref ATIM3_Mode0_Work_Mode */
    uint32_t u32CountClockSelect; /*!< 计数时钟选择 @ref ATIM3_Mode0_Count_Clock */
    uint32_t u32CountMode;        /*!< 计数模式配置 @ref ATIM3_Mode0_Count_Mode */
    uint32_t u32PRS;              /*!< 预除频配置 @ref ATIM3_Mode0_PRS */
    uint32_t u32EnTog;            /*!< 翻转输出使能 @ref ATIM3_Mode0_Tog_ON_OFF */
    uint32_t u32EnGate;           /*!< 门控使能 @ref ATIM3_Mode0_Gate_Enable */
    uint32_t u32GatePolar;        /*!< 门控极性控制 @ref ATIM3_Mode0_Gate_Polar */
} stc_atim3_mode0_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode0_Global_Macros ATIM3 Mode0全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode0_Work_Mode 工作模式
 * @{
 */
#define ATIM3_M0_M0CR_WORK_MODE_TIMER (0x0u) /*!< 定时器模式(模式0) */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode0_Gate_Polar 门控极性控制
 * @{
 */
#define ATIM3_M0_M0CR_GATE_POLAR_HIGH (0x0u)                       /*!< 端口门控高电平有效 */
#define ATIM3_M0_M0CR_GATE_POLAR_LOW  (ATIM3_MODE0_M0CR_GATEP_Msk) /*!< 端口门控低电平有效 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode0_Gate_Enable 门控使能
 * @{
 */
#define ATIM3_M0_M0CR_GATE_OFF (0x0u)                      /*!< 定时器门控禁止 */
#define ATIM3_M0_M0CR_GATE_ON  (ATIM3_MODE0_M0CR_GATE_Msk) /*!< 定时器门控使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode0_PRS 预除频配置
 * @{
 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS1   (0x0u)                             /*!< PCLK */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS2   (0x1u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/2 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS4   (0x2u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/4 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS8   (0x3u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/8 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS16  (0x4u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/16 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS32  (0x5u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/32 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS64  (0x6u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/64 */
#define ATIM3_M0_M0CR_ATIM3CLK_PRS256 (0x7u << ATIM3_MODE0_M0CR_PRS_Pos) /*!< PCLK/256 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode0_Tog_ON_OFF 翻转输出使能
 * @{
 */
#define ATIM3_M0_M0CR_TOG_OFF (0x0u)                       /*!< 翻转输出禁止 */
#define ATIM3_M0_M0CR_TOG_ON  (ATIM3_MODE0_M0CR_TOGEN_Msk) /*!< 翻转输出使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode0_Count_Clock 定时/计数功能选择
 * @{
 */
#define ATIM3_M0_M0CR_CT_PCLK (0x0u)                    /*!< 内部计数时钟PCLK */
#define ATIM3_M0_M0CR_CT_ETR  (ATIM3_MODE0_M0CR_CT_Msk) /*!< 外部输入计数时钟ETR */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode0_Count_Mode 计数模式配置
 * @{
 */
#define ATIM3_M0_M0CR_MD_32BIT_FREE (0x0u)                    /*!< 32位自由计数 */
#define ATIM3_M0_M0CR_MD_16BIT_ARR  (ATIM3_MODE0_M0CR_MD_Msk) /*!< 16位重载计数 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE1_Global_Types ATIM3 Mode1全局类型定义
 * @{
 */

/**
 * @brief ATIM3 mode1 配置结构体定义(模式1)
 */
typedef struct
{
    uint32_t u32WorkMode;         /*!< 工作模式设置 @ref ATIM3_Mode1_Work_Mode */
    uint32_t u32PRS;              /*!< 预除频配置 @ref ATIM3_Mode1_PRS */
    uint32_t u32CountClockSelect; /*!< 计数时钟选择 @ref ATIM3_Mode1_Count_Clock */
    uint32_t u32ShotMode;         /*!< 单次测量/循环测量选择 @ref ATIM3_Mode1_Shot_Mode */
} stc_atim3_mode1_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode1_Global_Macros ATIM3 Mode1全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode1_Work_Mode 工作模式
 * @{
 */
#define ATIM3_M1_M1CR_WORK_MODE_PWC (0x1u << ATIM3_MODE1_M1CR_MODE_Pos) /*!< PWC模式(模式1) */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode1_PRS 预除频配置
 * @{
 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS1   (0x0u)                             /*!< PCLK */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS2   (0x1u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/2 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS4   (0x2u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/4 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS8   (0x3u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/8 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS16  (0x4u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/16 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS32  (0x5u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/32 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS64  (0x6u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/64 */
#define ATIM3_M1_M1CR_ATIM3CLK_PRS256 (0x7u << ATIM3_MODE1_M1CR_PRS_Pos) /*!< PCLK/256 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode1_Count_Clock 计数时钟选择
 * @{
 */
#define ATIM3_M1_M1CR_CT_PCLK (0x0u)                    /*!< 内部计数时钟PCLK */
#define ATIM3_M1_M1CR_CT_ETR  (ATIM3_MODE1_M1CR_CT_Msk) /*!< 外部输入计数时钟ETR */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode1_Shot_Mode 单次测量/循环测量选择
 * @{
 */
#define ATIM3_M1_M1CR_SHOT_CYCLE (0x0u)                         /*!< 循环测量 */
#define ATIM3_M1_M1CR_SHOT_ONE   (ATIM3_MODE1_M1CR_ONESHOT_Msk) /*!< 单次测量 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode1_PWC_Start_End_Edge PWC启动停止边沿选择
 * @{
 */
#define ATIM3_M1_M1CR_DETECT_EDGE_RISE_TO_RISE (0x0u)                                                      /*!< 上沿-->上沿 (周期) */
#define ATIM3_M1_M1CR_DETECT_EDGE_FALL_TO_RISE (ATIM3_MODE1_M1CR_EDG1ST_Msk)                               /*!< 下沿-->上沿 (低电平) */
#define ATIM3_M1_M1CR_DETECT_EDGE_RISE_TO_FALL (ATIM3_MODE1_M1CR_EDG2ND_Msk)                               /*!< 上沿-->下沿 (高电平) */
#define ATIM3_M1_M1CR_DETECT_EDGE_FALL_TO_FALL (ATIM3_MODE1_M1CR_EDG2ND_Msk | ATIM3_MODE1_M1CR_EDG1ST_Msk) /*!< 下沿-->下沿 (周期) */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3PWC_Global_Types ATIM3 PWC全局类型定义
 * @{
 */

/**
 * @brief PWC输入配置结构体定义(模式1)
 */
typedef struct
{
    uint32_t u32TsSelect;  /*!< 触发输入源选择 @ref ATIM3_PWC_Trigger_Source */
    uint32_t u32IA0Select; /*!< CHA0输入选择 @ref ATIM3_PWC_IA0S_Input */
    uint32_t u32IB0Select; /*!< CHB0输入选择 @ref ATIM3_PWC_IB0S_Input */
    uint32_t u32ETR;       /*!< ETR相位选择 @ref ATIM3_PWC_ET_Polarity */
    uint32_t u32FltETR;    /*!< ETR滤波设置 @ref ATIM3_PWC_Input_Filter */
    uint32_t u32FltIA0;    /*!< CHA0滤波设置 @ref ATIM3_PWC_Input_Filter */
    uint32_t u32FltIB0;    /*!< CHB0滤波设置 @ref ATIM3_PWC_Input_Filter */
} stc_atim3_pwc_input_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_PWC_Global_Macros ATIM3 PWC全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_PWC_Trigger_Source MSCR_TS触发输入源选择
 * @{
 */
#define ATIM3_M1_MSCR_TS_ETR         (0x0u)                            /*!< 端口ETR的滤波相位选择后的信号ETFP */
#define ATIM3_M1_MSCR_TS_ITR0        (0x1u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 内部互联信号 ITR0 */
#define ATIM3_M1_MSCR_TS_ITR1        (0x2u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 内部互联信号 ITR1 */
#define ATIM3_M1_MSCR_TS_ITR2        (0x3u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 内部互联信号 ITR2 */
#define ATIM3_M1_MSCR_TS_ITR3        (0x4u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 内部互联信号 ITR3 */
#define ATIM3_M1_MSCR_TS_CH0A_EDGE   (0x5u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 端口CH0A的边沿信号 */
#define ATIM3_M1_MSCR_TS_CH0A_FILTER (0x6u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 端口CH0A的滤波相位选择后的信号IAFP */
#define ATIM3_M1_MSCR_TS_CH0B_FILTER (0x7u << ATIM3_MODE1_MSCR_TS_Pos) /*!< 端口CH0B的滤波相位选择后的信号IBFP */
/**
 * @}
 */

/**
 * @defgroup ATIM3_PWC_IA0S_Input MSCR_IA0S CHA0输入选择
 * @{
 */
#define ATIM3_M1_MSCR_IA0S_CH0A       (0x0u)                      /*!< CH0A */
#define ATIM3_M1_MSCR_IA0S_CH012A_XOR (ATIM3_MODE1_MSCR_IA0S_Msk) /*!< CH0A CH1A CH2A XOR */
/**
 * @}
 */

/**
 * @defgroup ATIM3_PWC_IB0S_Input MSCR_IB0S CHB0输入选择
 * @{
 */
#define ATIM3_M1_MSCR_IB0S_CH0B   (0x0u)                      /*!< CH0B */
#define ATIM3_M1_MSCR_IB0S_TS_SEL (ATIM3_MODE1_MSCR_IB0S_Msk) /*!< 内部触发TS选择信号 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_PWC_Input_Filter 滤波时钟配置
 * @{
 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_NONE          (0x0u)                                      /*!< 无滤波 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV1_2 (0x1u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK 2个连续有效 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV1_4 (0x2u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK 4个连续有效 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV1_6 (0x3u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK 6个连续有效 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV4_4 (0x4u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/4 4个连续有效 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV4_5 (0x5u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/4 6个连续有效 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV8_4 (0x6u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/8 4个连续有效 */
#define ATIM3_M1_FLTR_FLTA0_B0_ET_3_PCLK_DIV8_6 (0x7u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/8 6个连续有效 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_PWC_ET_Polarity  ETR 输入相位选择
 * @{
 */
#define ATIM3_M1_FLTR_ETP_POLARITY_POSITIVE (0x0u)                     /*!< 同相位 */
#define ATIM3_M1_FLTR_ETP_POLARITY_NEGATIVE (ATIM3_MODE1_FLTR_ETP_Msk) /*!< 反相输入 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 mode23 配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32WorkMode;         /*!< 工作模式设置 @ref ATIM3_Mode23_Work_Mode */
    uint32_t u32CountDir;         /*!< 计数方向 @ref ATIM3_Mode23_DIR */
    uint32_t u32PRS;              /*!< 时钟预除频配置 @ref ATIM3_Mode23_PRS */
    uint32_t u32CountClockSelect; /*!< 计数时钟选择 @ref ATIM3_Mode23_Count_Clock */
    uint32_t u32PWMTypeSelect;    /*!< PWM模式选择（独立/互补） @ref ATIM3_Mode23_PWM_Type */
    uint32_t u32PWM2sSelect;      /*!< OCREFA双点比较功能选择 @ref ATIM3_Mode23_OCREFA_Compare_Type */
    uint32_t u32ShotMode;         /*!< 单次触发模式使能/禁止 @ref ATIM3_Mode23_Shot_Mode */
    uint32_t u32URSSelect;        /*!< 更新源选择 @ref ATIM3_Mode23_Refresh_Source */
} stc_atim3_mode23_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_Work_Mode 工作模式
 * @{
 */
#define ATIM3_M23_M23CR_WORK_MODE_SAWTOOTH   (0x2u << ATIM3_MODE23_M23CR_MODE_Pos) /*!< 锯齿波模式(模式2) */
#define ATIM3_M23_M23CR_WORK_MODE_TRIANGULAR (0x3u << ATIM3_MODE23_M23CR_MODE_Pos) /*!< 三角波模式(模式3) */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_PRS 预除频配置
 * @{
 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS1   (0x0u)                               /*!< PCLK */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS2   (0x1u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/2 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS4   (0x2u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/4 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS8   (0x3u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/8 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS16  (0x4u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/16 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS32  (0x5u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/32 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS64  (0x6u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/64 */
#define ATIM3_M23_M23CR_ATIM3CLK_PRS256 (0x7u << ATIM3_MODE23_M23CR_PRS_Pos) /*!< PCLK/256 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_DIR 计数方向
 * @{
 */
#define ATIM3_M23_M23CR_DIR_UP_CNT   (0x0u)                       /*!< 向上计数 */
#define ATIM3_M23_M23CR_DIR_DOWN_CNT (ATIM3_MODE23_M23CR_DIR_Msk) /*!< 向下计数 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Count_Clock 计数时钟选择
 * @{
 */
#define ATIM3_M23_M23CR_CT_PCLK (0x0u)                      /*!< 内部计数时钟PCLK */
#define ATIM3_M23_M23CR_CT_ETR  (ATIM3_MODE23_M23CR_CT_Msk) /*!< 外部输入计数时钟ETR */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_PWM_Type PWM模式选择（独立/互补）
 * @{
 */
#define ATIM3_M23_M23CR_COMP_PWM_INDEPT (0x0u)                        /*!< 独立PWM */
#define ATIM3_M23_M23CR_COMP_PWM_COMP   (ATIM3_MODE23_M23CR_COMP_Msk) /*!< 互补PWM */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_OCREFA_Compare_Type OCREFA双点比较功能选择
 * @{
 */
#define ATIM3_M23_M23CR_PWM2S_COMPARE_DOUBLE_POINT (0x0u)                         /*!< 双点比较 */
#define ATIM3_M23_M23CR_PWM2S_COMPARE_SINGLE_POINT (ATIM3_MODE23_M23CR_PWM2S_Msk) /*!< 单点比较 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Shot_Mode 单次触发模式使能/禁止
 * @{
 */
#define ATIM3_M23_M23CR_SHOT_CYCLE (0x0u)                           /*!< 循环计数 */
#define ATIM3_M23_M23CR_SHOT_ONE   (ATIM3_MODE23_M23CR_ONESHOT_Msk) /*!< 单次，发送事件更新后定时器停止 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Refresh_Source 更新源选择
 * @{
 */
#define ATIM3_M23_M23CR_URS_OV_UND_UG_RST (0x0u)                       /*!< 上溢出/下溢出/软件更新UG/从模式复位 */
#define ATIM3_M23_M23CR_URS_OV_UND        (ATIM3_MODE23_M23CR_URS_Msk) /*!< 上溢出/下溢出 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_CCRxx_Channel CCRxx channel number define
 * @{
 */
#define ATIM3_COMPARE_CAPTURE_CH0A (0x0u) /*!< ATIM3_CCR0A相对于ATIM3_CCR0A的偏移 */
#define ATIM3_COMPARE_CAPTURE_CH0B (0x1u) /*!< ATIM3_CCR0B相对于ATIM3_CCR0A的偏移 */
#define ATIM3_COMPARE_CAPTURE_CH1A (0x2u) /*!< ATIM3_CCR1A相对于ATIM3_CCR0A的偏移 */
#define ATIM3_COMPARE_CAPTURE_CH1B (0x3u) /*!< ATIM3_CCR1B相对于ATIM3_CCR0A的偏移 */
#define ATIM3_COMPARE_CAPTURE_CH2A (0x4u) /*!< ATIM3_CCR2A相对于ATIM3_CCR0A的偏移 */
#define ATIM3_COMPARE_CAPTURE_CH2B (0x5u) /*!< ATIM3_CCR2B相对于ATIM3_CCR0A的偏移 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 Gate配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32GateFuncSelect; /*!< Gate比较、捕获功能选择 @ref ATIM3_Mode23_Gate_Func */
    uint32_t u32GateRiseCap;    /*!< GATE作为捕获功能时，上沿捕获有效控制 @ref ATIM3_Mode23_Gate_Func_Rising_Enable */
    uint32_t u32GateFallCap;    /*!< GATE作为捕获功能时，下沿捕获有效控制 @ref ATIM3_Mode23_Gate_Func_Falling_Enable */
} stc_atim3_m23_gate_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_Gate_Func Gate比较、捕获功能选择
 * @{
 */
#define ATIM3_M23_M23CR_GATE_FUN_COMPARE (0x0u)                       /*!< 比较模式 */
#define ATIM3_M23_M23CR_GATE_FUN_CAPTURE (ATIM3_MODE23_M23CR_CSG_Msk) /*!< 捕获模式 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Gate_Func_Rising_Enable GATE作为捕获功能时，上沿捕获有效控制
 * @{
 */
#define ATIM3_M23_M23CR_GATE_CAP_RISE_DISABLE (0x0u)                       /*!< 上沿捕获无效 */
#define ATIM3_M23_M23CR_GATE_CAP_RISE_ENABLE  (ATIM3_MODE23_M23CR_CRG_Msk) /*!< 上沿捕获有效 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Gate_Func_Falling_Enable GATE作为捕获功能时，下沿捕获有效控制
 * @{
 */
#define ATIM3_M23_M23CR_GATE_CAP_FALL_DISABLE (0x0u)                       /*!< 下沿捕获无效 */
#define ATIM3_M23_M23CR_GATE_CAP_FALL_ENABLE  (ATIM3_MODE23_M23CR_CFG_Msk) /*!< 下沿捕获有效 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 主从触发 配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32MasterSlaveSelect; /*!< 主从模式选择 @ref ATIM3_Mode23_Master_Slaver */
    uint32_t u32MasterSrc;         /*!< 主模式触发源选择 @ref ATIM3_Mode23_Master_Source */
    uint32_t u32SlaveModeSelect;   /*!< 从模式选择 @ref ATIM3_Mode23_Slave_Func */
    uint32_t u32TsSelect;          /*!< 触发输入源选择 @ref ATIM3_Mode23_Trigger_Source */
} stc_atim3_m23_master_slave_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_Master_Slaver 主从模式选择
 * @{
 */
#define ATIM3_M23_MSCR_MSM_SLAVE  (0x0u)                      /*!< 从模式 */
#define ATIM3_M23_MSCR_MSM_MASTER (ATIM3_MODE23_MSCR_MSM_Msk) /*!< 主模式 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Master_Source 主模式触发源选择
 * @{
 */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_UG      (0x0u)                              /*!< 软件更新UG，写CR.UG */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_CTEN    (0x1u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 定时器使能CTEN */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_UEV     (0x2u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 定时器事件更新UEV */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_CMPSO   (0x3u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 比较匹配选择输出CMPSO */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_OCREF0A (0x4u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 定时器比较参数输出OCREF0A */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_OCREF1A (0x5u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 定时器比较参数输出OCREF1A */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_OCREF2A (0x6u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 定时器比较参数输出OCREF2A */
#define ATIM3_M23_MSCR_MMS_TRIG_SOURCE_OCREF0B (0x7u << ATIM3_MODE23_MSCR_MMS_Pos) /*!< 定时器比较参数输出OCREF0B */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Slave_Func 从模式选择
 * @{
 */
#define ATIM3_M23_MSCR_SMS_INTERNAL_CLK  (0x0u)                              /*!< 使用内部时钟 */
#define ATIM3_M23_MSCR_SMS_RESET         (0x1u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 复位功能 */
#define ATIM3_M23_MSCR_SMS_TRIG          (0x2u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 触发模式 */
#define ATIM3_M23_MSCR_SMS_EXTERNAL_CLK  (0x3u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 外部时钟模式 */
#define ATIM3_M23_MSCR_SMS_QUADRATURE_M1 (0x4u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 正交编码计数模式1 */
#define ATIM3_M23_MSCR_SMS_QUADRATURE_M2 (0x5u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 正交编码计数模式2 */
#define ATIM3_M23_MSCR_SMS_QUADRATURE_M3 (0x6u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 正交编码计数模式3 */
#define ATIM3_M23_MSCR_SMS_GATE          (0x7u << ATIM3_MODE23_MSCR_SMS_Pos) /*!< 门控功能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Trigger_Source 触发输入源选择
 * @{
 */
#define ATIM3_M23_MSCR_TS_ETFP      (0x0u)                             /*!< 端口ETR的滤波相位选择后的信号ETFP */
#define ATIM3_M23_MSCR_TS_ITR0      (0x1u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 内部互联信号 ITR0 */
#define ATIM3_M23_MSCR_TS_ITR1      (0x2u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 内部互联信号 ITR1 */
#define ATIM3_M23_MSCR_TS_ITR2      (0x3u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 内部互联信号 ITR2 */
#define ATIM3_M23_MSCR_TS_ITR3      (0x4u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 内部互联信号 ITR3 */
#define ATIM3_M23_MSCR_TS_CH0A_EDGE (0x5u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 端口CH0A的边沿信号 */
#define ATIM3_M23_MSCR_TS_IAFP      (0x6u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 端口CH0A的滤波相位选择后的信号IAFP */
#define ATIM3_M23_MSCR_TS_IBFP      (0x7u << ATIM3_MODE23_MSCR_TS_Pos) /*!< 端口CH0B的滤波相位选择后的信号IBFP */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_IA0_IN_Sel IA0 输入选择
 * @{
 */
#define ATIM3_M23_MSCR_IA0_CH0A       (0x0u)                       /*!< IA0选择CH0A */
#define ATIM3_M23_MSCR_IA0_CH012A_XOR (ATIM3_MODE23_MSCR_IA0S_Msk) /*!< CH0A,CH1A,CH2A的XOR的值 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_IB0_IN_Sel IB0 输入选择
 * @{
 */
#define ATIM3_M23_MSCR_IB0_CH0B      (0x0u)                       /*!<IB0选择CH0B */
#define ATIM3_M23_MSCR_IB0_TS_SOURCE (ATIM3_MODE23_MSCR_IB0S_Msk) /*!<IB0选择TS的源 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 CHxA通道比较、输出控制 配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32CHxCompareCap;       /*!< CHxA/CHxB比较/捕获功能选择 @ref ATIM3_Mode23_CH_Mode */
    uint32_t u32CHxCompareModeCtrl;  /*!< CHxA/CHxB通道比较控制 @ref ATIM3_Mode23_PWM_Comp_Mode */
    uint32_t u32CHxPolarity;         /*!< CHxA/CHxB输出极性控制 @ref ATIM3_Mode23_PWM_Polarity */
    uint32_t u32CHxCompareBufEn;     /*!< 比较A/B缓存功能 使能/禁止 @ref ATIM3_Mode23_CH_Buf_Enable */
    uint32_t u32CHxCompareIntSelect; /*!< CHxA/CHxB比较匹配中断选择 @ref ATIM3_Mode23_CHxA/B_Match_INT */
} stc_atim3_m23_compare_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_CH_Sel 通道序号
 * @{
 */
#define ATIM3_M23_OUTPUT_CHANNEL_CH0 (0x0u)
#define ATIM3_M23_OUTPUT_CHANNEL_CH1 (0x1u)
#define ATIM3_M23_OUTPUT_CHANNEL_CH2 (0x2u)
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_CH_Mode CHxA/CHxB比较/捕获功能选择
 * @{
 */
#define ATIM3_M23_CRCHx_CSA_CSB_COMPARE (0x0u)                       /*!< 比较模式 */
#define ATIM3_M23_CRCHx_CSA_CSB_CAPTURE (ATIM3_MODE23_CRCH0_CSA_Msk) /*!< 捕获模式 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_CH_Buf_Enable 比较A/B缓存功能 使能/禁止
 * @{
 */
#define ATIM3_M23_CRCHx_BUFEx_DISABLE (0x0u)                         /*!< 禁止 */
#define ATIM3_M23_CRCHx_BUFEx_ENABLE  (ATIM3_MODE23_CRCH0_BUFEA_Msk) /*!< 使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_CHxA/B_Match_INT CHxA/CHxB比较匹配中断选择
 * @{
 */

