ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_atim3.h
/**
 * @defgroup ATIM3_Mode23_CHxA_Match_INT CHxA比较匹配中断选择
 * @{
 */
#define ATIM3_M23_M23CR_CISA_DISABLE_INT   (0x0u)                               /*!< 无匹配 */
#define ATIM3_M23_M23CR_CISA_RISE_INT      (0x1u << ATIM3_MODE23_M23CR_CIS_Pos) /*!< 上升沿匹配 */
#define ATIM3_M23_M23CR_CISA_FALL_INT      (0x2u << ATIM3_MODE23_M23CR_CIS_Pos) /*!< 下降沿匹配 */
#define ATIM3_M23_M23CR_CISA_RISE_FALL_INT (0x3u << ATIM3_MODE23_M23CR_CIS_Pos) /*!< 上升沿和下降沿匹配 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_CHxB_Match_INT CHxB比较匹配中断选择
 * @{
 */
#define ATIM3_M23_CRCHx_CISB_DISABLE_INT   (0x0u)                                /*!< 无匹配 */
#define ATIM3_M23_CRCHx_CISB_RISE_INT      (0x1u << ATIM3_MODE23_CRCH0_CISB_Pos) /*!< 上升沿匹配 */
#define ATIM3_M23_CRCHx_CISB_FALL_INT      (0x2u << ATIM3_MODE23_CRCH0_CISB_Pos) /*!< 下降沿匹配 */
#define ATIM3_M23_CRCHx_CISB_RISE_FALL_INT (0x3u << ATIM3_MODE23_CRCH0_CISB_Pos) /*!< 上升沿和下降沿匹配 */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_PWM_Comp_Mode CHxA/CHxB通道比较控制
 * @{
 */
#define ATIM3_M23_FLTR_OCMxx_FORCE_LOW         (0x0u)                                      /*!< 强制为0低电平 */
#define ATIM3_M23_FLTR_OCMxx_FORCE_HIGH        (0x1u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< 强制为1高电平 */
#define ATIM3_M23_FLTR_OCMxx_COMP_FORCE_LOW    (0x2u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< 比较匹配时候强制为0低电平 */
#define ATIM3_M23_FLTR_OCMxx_COMP_FORCE_HIGH   (0x3u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< 比较匹配时候强制为1高电平 */
#define ATIM3_M23_FLTR_OCMxx_COMP_REVERSE      (0x4u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< 比较匹配时候翻转 */
#define ATIM3_M23_FLTR_OCMxx_COMP_ONE_PRD_HIGH (0x5u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< 比较匹配时候输出一个计数周期的高电平 */
#define ATIM3_M23_FLTR_OCMxx_PWM_MODE_1        (0x6u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PWM模式1 */
#define ATIM3_M23_FLTR_OCMxx_PWM_MODE_2        (0x7u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PWM模式2 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_PWM_Polarity CHxA/CHxB输出极性控制
 * @{
 */
#define ATIM3_M23_FLTR_CCPxx_NORMAL_IN_OUT  (0x0u)                        /*!< 正常输出 */
#define ATIM3_M23_FLTR_CCPxx_REVERSE_IN_OUT (ATIM3_MODE23_FLTR_CCPA0_Msk) /*!< 反向输出 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 CHA/CHB通道捕获、输入控制 配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32CHxCompareCap;    /*!< CHxA/CHxB比较/捕获功能选择 @ref ATIM3_Mode23_CH_Mode */
    uint32_t u32CHxCaptureSelect; /*!< CHxA/CHxB捕获边沿选择 @ref ATIM3_Mode23_Capture_Edge */
    uint32_t u32CHxInFlt;         /*!< CHxA/CHxB通道捕获滤波控制 @ref ATIM3_Mode23_Filter */
    uint32_t u32CHxPolarity;      /*!< CHxA/CHxB输入相位 @ref ATIM3_Mode23_PWM_Polarity */
} stc_atim3_m23_input_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_Capture_Edge CRA_CFA(BKSA)& CRB_CFB(BKSB) CHxA/CHxB捕获边沿选择
 * @{
 */
#define ATIM3_M23_CRCHx_CRxCFx_CAPTURE_EDGE_DISABLE   (0x0u)                                        /*!< 禁止上升沿或下降沿捕获 */
#define ATIM3_M23_CRCHx_CRxCFx_CAPTURE_EDGE_RISE      (0x1u << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos) /*!< 上升沿捕获使能  */
#define ATIM3_M23_CRCHx_CRxCFx_CAPTURE_EDGE_FALL      (0x2u << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos) /*!< 下降沿捕获使能  */
#define ATIM3_M23_CRCHx_CRxCFx_CAPTURE_EDGE_RISE_FALL (0x3u << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos) /*!< 上升沿和下降沿捕获使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Filter FLTAx/FLTBx/FLTET CHxB通道捕获滤波控制
 * @{
 */
#define ATIM3_M23_FLTR_FLTxx_NONE              (0x0u)                                      /*!< 无滤波 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV1_2 (0x1u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK 2个连续有效 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV1_4 (0x2u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK 4个连续有效 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV1_6 (0x3u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK 6个连续有效 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV4_4 (0x4u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/4 4个连续有效 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV4_5 (0x5u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/4 6个连续有效 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV8_4 (0x6u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/8 4个连续有效 */
#define ATIM3_M23_FLTR_FLTxx_THREE_PCLK_DIV8_6 (0x7u << ATIM3_MODE23_FLTR_OCMA0_FLTA0_Pos) /*!< PCLK/8 6个连续有效 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 ETR输入相位滤波配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32ETRPolarity; /*!< ETR输入极性设置 @ref ATIM3_Mode23_Input_Polarity */
    uint32_t u32ETRFlt;      /*!< ETR滤波设置     @ref ATIM3_Mode23_Filter         */
} stc_atim3_m23_etr_input_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_Input_Polarity ETR输入极性设置
 * @{
 */
#define ATIM3_M23_FLTR_ETP_NORMAL_IN  (0x0u)                      /*!< 正常输入 */
#define ATIM3_M23_FLTR_ETP_REVERSE_IN (ATIM3_MODE23_FLTR_ETP_Msk) /*!< 反向输入 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief ATIM3 刹车BK输入相位滤波配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32EnBrake;       /*!< 刹车使能 @ref ATIM3_Mode23_Brake_Enable */
    uint32_t u32EnVCBrake;     /*!< 使能VC刹车 @ref ATIM3_Mode23_Brake_VC_Enable */
    uint32_t u32EnSafetyBk;    /*!< 使能safety刹车 @ref ATIM3_Mode23_Brake_Safe_Enable */
    uint32_t u32BrakePolarity; /*!< 刹车BK输入极性设置 @ref ATIM3_Mode23_Brake_Polarity */
    uint32_t u32BrakeFlt;      /*!< 刹车BK滤波设置 @ref ATIM3_Mode23_Filter */
} stc_atim3_m23_bk_input_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_Brake_Enable 刹车使能
 * @{
 */
#define ATIM3_M23_DTR_BKE_BRAKE_DISABLE (0x0u)                     /*!< 禁止 */
#define ATIM3_M23_DTR_BKE_BRAKE_ENABLE  (ATIM3_MODE23_DTR_BKE_Msk) /*!< 使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Brake_VC_Enable 使能VC刹车
 * @{
 */
#define ATIM3_M23_DTR_VCE_BRAKE_DISABLE (0x0u)                     /*!< 禁止 */
#define ATIM3_M23_DTR_VCE_BRAKE_ENABLE  (ATIM3_MODE23_DTR_VCE_Msk) /*!< 使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Brake_Safe_Enable 使能safety刹车
 * @{
 */
#define ATIM3_M23_DTR_SAFEEN_BRAKE_DISABLE (0x0u)                        /*!< 禁止 */
#define ATIM3_M23_DTR_SAFEEN_BRAKE_ENABLE  (ATIM3_MODE23_DTR_SAFEEN_Msk) /*!< 使能 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Brake_Port_Out_Level 刹车发生时端口电平及状态
 * @{
 */
#define ATIM3_M23_CRCHx_BKSA_BKSB_PORT_OUTPUT_HIZ  (0x0u)                                        /*!< 高阻态 */
#define ATIM3_M23_CRCHx_BKSA_BKSB_PORT_OUTPUT_KEEP (0x1u << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos) /*!< 保持，无影响 */
#define ATIM3_M23_CRCHx_BKSA_BKSB_PORT_OUTPUT_LOW  (0x2u << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos) /*!< 强制输出低电平 */
#define ATIM3_M23_CRCHx_BKSA_BKSB_PORT_OUTPUT_HIGH (0x3u << ATIM3_MODE23_CRCH0_CFA_CRA_BKSA_Pos) /*!< 强制输出高电平 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_Brake_Polarity 刹车BK输入极性设置
 * @{
 */
#define ATIM3_M23_FLTR_BKP_NORMAL_IN  (0x0u)                      /*!< 正相 */
#define ATIM3_M23_FLTR_BKP_REVERSE_IN (ATIM3_MODE23_FLTR_BKP_Msk) /*!< 反相 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief 死区功能配置结构体定义(模式23)
 */
typedef struct
{
    boolean_t bEnDeadTime;      /*!< 死区使能设置，FALSE: 禁止, TRUE: 使能 */
    uint32_t  u32DeadTimeValue; /*!< 8 bit 死区时间设置 */
} stc_atim3_m23_dt_init_t;

/**
 * @brief 触发ADC配置结构体定义(模式23)
 */
typedef struct
{
    boolean_t bEnTrigADC;        /*!< 触发ADC全局控制，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnUevTrigADC;     /*!< 事件更新触发ADC，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnCH0ACmpTrigADC; /*!< CH0A比较匹配触发ADC，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnCH0BCmpTrigADC; /*!< CH0B比较匹配触发ADC，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnCH1ACmpTrigADC; /*!< CH0A比较匹配触发ADC，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnCH1BCmpTrigADC; /*!< CH0B比较匹配触发ADC，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnCH2ACmpTrigADC; /*!< CH0A比较匹配触发ADC，FALSE: 禁止, TRUE: 使能 */
    boolean_t bEnCH2BCmpTrigADC; /*!< CH0B比较匹配触发ADC，FALSE: 禁止, TRUE: 使能 */
} stc_atim3_m23_adc_trig_init_t;

/**
 * @brief 重复计数功能配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t u32EnUnderFlowMask; /*!< 下溢使能屏蔽 @ref ATIM3_Mode23_UND_Repeat_Cnt */
    uint32_t u32EnOverFLowMask;  /*!< 上溢使能屏蔽 @ref ATIM3_Mode23_OVF_Repeat_Cnt */
    uint32_t u32RepeatCountNum;  /*!< 8 bit重复计数次数设置 */
} stc_atim3_m23_rcr_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_UND_Repeat_Cnt Under Flow Repeat Count setting
 * @{
 */
#define ATIM3_M23_RCR_UND_INT_EVT_CNT_ENABLE (0x0u)                     /*!< 下溢出计数使能，RCR计算下溢出 */
#define ATIM3_M23_RCR_UND_INT_EVT_CNT_MASK   (ATIM3_MODE23_RCR_UND_Msk) /*!< 下溢出计数屏蔽，RCR不计算下溢出 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_OVF_Repeat_Cnt Over Flow Repeat Count setting
 * @{
 */
#define ATIM3_M23_RCR_OVF_INT_EVT_CNT_ENABLE (0x0u)                    /*!< 上溢出不屏蔽，RCR计算上溢出 */
#define ATIM3_M23_RCR_OVF_INT_EVT_CNT_MASK   (ATIM3_MODE23_RCR_OV_Msk) /*!< 上溢出屏蔽，RCR不计算上溢出 */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ATIM3_MODE23_Global_Types ATIM3 Mode23全局类型定义
 * @{
 */

/**
 * @brief OCREF清除功能 配置结构体定义(模式23)
 */
typedef struct
{
    uint32_t  u32OCRefClearSrcSelect; /*!< OCREF清除源选择 @ref ATIM3_Mode23_OCREF_Clear_Source */
    boolean_t bOCSourceClearEn;       /*!< 来自OCCS的OCREF_Clear源是否使能清除OCREF输出,FALSE: 禁止, TRUE: 使能 */
} stc_atim3_m23_ocref_clr_init_t;
/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_Mode23_OCREF_Clear_Source OCREF清除源选择
 * @{
 */
#define ATIM3_M23_M23CR_OCCS_VC  (0x0u)                        /*!< 来自VC输出的OCREF_Clear */
#define ATIM3_M23_M23CR_OCCS_ETR (ATIM3_MODE23_M23CR_OCCS_Msk) /*!< 来自ETR端口滤波相位选择后的OCREF_Clear */
/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Mode23_Global_Macros ATIM3 Mode23全局宏定义
 * @{
 */

/**
 * @defgroup ATIM3_INT_Status_Flags     ATIM3 Mode0/1/2/3 Interrupt Status Flags
 * @{
 */
#define ATIM3_FLAG_UI      (ATIM3_MODE23_IFR_UIF)  /*!< Mode0/1:溢出中断标志；Mode2/3:事件更新中断标志 */
#define ATIM3_FLAG_PWC_CA0 (ATIM3_MODE23_IFR_CA0F) /*!< Mode1:脉冲宽度测量中断标志；Mode2/3:通道CH0A 发生捕获/比较匹配标志 */
#define ATIM3_FLAG_CA1     (ATIM3_MODE23_IFR_CA1F) /*!< Mode2/3:通道CH1A 发生捕获/比较匹配标志 */
#define ATIM3_FLAG_CA2     (ATIM3_MODE23_IFR_CA2F) /*!< Mode2/3:通道CH2A 发生捕获/比较匹配标志 */
#define ATIM3_FLAG_CB0     (ATIM3_MODE23_IFR_CB0F) /*!< Mode2/3:通道CH0B 发生捕获/比较匹配标志 */
#define ATIM3_FLAG_CB1     (ATIM3_MODE23_IFR_CB1F) /*!< Mode2/3:通道CH1B 发生捕获/比较匹配标志 */
#define ATIM3_FLAG_CB2     (ATIM3_MODE23_IFR_CB2F) /*!< Mode2/3:通道CH2B 发生捕获/比较匹配标志 */
#define ATIM3_FLAG_CA0E    (ATIM3_MODE23_IFR_CA0E) /*!< Mode2/3:通道CH0A 捕获数据丢失标志 */
#define ATIM3_FLAG_CA1E    (ATIM3_MODE23_IFR_CA1E) /*!< Mode2/3:通道CH1A 捕获数据丢失标志 */
#define ATIM3_FLAG_CA2E    (ATIM3_MODE23_IFR_CA2E) /*!< Mode2/3:通道CH2A 捕获数据丢失标志 */
#define ATIM3_FLAG_CB0E    (ATIM3_MODE23_IFR_CB0E) /*!< Mode2/3:通道CH0B 捕获数据丢失标志 */
#define ATIM3_FLAG_CB1E    (ATIM3_MODE23_IFR_CB1E) /*!< Mode2/3:通道CH1B 捕获数据丢失标志 */
#define ATIM3_FLAG_CB2E    (ATIM3_MODE23_IFR_CB2E) /*!< Mode2/3:通道CH2B 捕获数据丢失标志 */
#define ATIM3_FLAG_BI      (ATIM3_MODE23_IFR_BIF)  /*!< Mode2/3:刹车中断标志 */
#define ATIM3_FLAG_TI      (ATIM3_MODE23_IFR_TIF)  /*!< Mode2/3:触发中断标志 */
#define ATIM3_FLAG_OV      (ATIM3_MODE23_IFR_OVF)  /*!< Mode2/3:上溢出中断标志 */
#define ATIM3_FLAG_UND     (ATIM3_MODE23_IFR_UNDF) /*!< Mode2/3:下溢出中断标志 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode1_INT_Request ATIM3 Mode1 Interrupt Request
 * @{
 */
#define ATIM3_M1_INT_UI  (0x00000001u) /*!< 模式1 溢出中断 */
#define ATIM3_M1_INT_CA0 (0x00000002u) /*!< 模式1 脉宽测量完成中断 */
/**
 * @}
 */

/**
 * @defgroup ATIM3_Mode23_INT_Request ATIM3 Mode23 Interrupt Request
 * @{
 */
#define INTERRUPT_M23CR_ID   (0x80000000u)
#define INTERRUPT_CRCH0_ID   (0x08000000u)
#define INTERRUPT_CRCH1_ID   (0x04000000u)
#define INTERRUPT_CRCH2_ID   (0x02000000u)

#define INTERRUPT_M23CR_MASK (0x30180400u)
#define INTERRUPT_CRCH0_MASK (0x00000300u)
#define INTERRUPT_CRCH1_MASK (0x000000C0u)
#define INTERRUPT_CRCH2_MASK (0x00000030u)

#define ATIM3_M23_INT_UI     (INTERRUPT_M23CR_ID | ATIM3_MODE23_M23CR_UIE)            /*!< 模式23 溢出中断 */
#define ATIM3_M23_INT_BI     (INTERRUPT_M23CR_ID | ATIM3_MODE23_M23CR_BIE)            /*!< 模式23 刹车中断 */
#define ATIM3_M23_INT_TI     (INTERRUPT_M23CR_ID | ATIM3_MODE23_M23CR_TIE)            /*!< 模式23 触发中断 */
#define ATIM3_M23_INT_OV     (INTERRUPT_M23CR_ID | ATIM3_MODE23_M23CR_OVE)            /*!< 模式23 上溢中断 */
#define ATIM3_M23_INT_UND    (INTERRUPT_M23CR_ID | ATIM3_MODE23_M23CR_UNDE)           /*!< 模式23 下溢中断 */
#define ATIM3_M23_INT_CA0    (INTERRUPT_CRCH0_ID | ATIM3_MODE23_CRCH0_CIEA)           /*!< 模式23 比较捕获CH0A中断 */
#define ATIM3_M23_INT_CB0    (INTERRUPT_CRCH0_ID | ATIM3_MODE23_CRCH0_CIEB)           /*!< 模式23 比较捕获CH0B中断 */
#define ATIM3_M23_INT_CA1    (INTERRUPT_CRCH1_ID | (ATIM3_MODE23_CRCH1_CIEA >> 0x2u)) /*!< 模式23 比较捕获CH1A中断 */
#define ATIM3_M23_INT_CB1    (INTERRUPT_CRCH1_ID | (ATIM3_MODE23_CRCH1_CIEB >> 0x2u)) /*!< 模式23 比较捕获CH1B中断 */
#define ATIM3_M23_INT_CA2    (INTERRUPT_CRCH2_ID | (ATIM3_MODE23_CRCH2_CIEA >> 0x4u)) /*!< 模式23 比较捕获CH2A中断 */
#define ATIM3_M23_INT_CB2    (INTERRUPT_CRCH2_ID | (ATIM3_MODE23_CRCH2_CIEB >> 0x4u)) /*!< 模式23 比较捕获CH2B中断 */
/**
 * @}
 */

/**
 * @}
 */
/******************************************************************************
  Global function prototypes (definition in C source)
*******************************************************************************/
/**
 * @addtogroup ATIM3_Global_Functions ATIM3全局函数定义 模式0初始化及相关功能操作
 * @{
 */
void ATIM3_Mode0_Init(stc_atim3_mode0_init_t *pstcCfg); /* timer配置及初始化 */

