ZeroZap/xhsc/HC32L021/driver/inc/hc32l021_atim3.h
void ATIM3_Mode0_Run(void);  /* timer 启动 */
void ATIM3_Mode0_Stop(void); /* timer 停止 */

void     ATIM3_Mode0_ARRSet(uint32_t u16Data);   /* 重载值设置 */
uint32_t ATIM3_Mode0_ARRGet(void);               /* 重载值获取 */
void     ATIM3_Mode0_Cnt16Set(uint32_t u16Data); /* 16位计数值设置 */
uint32_t ATIM3_Mode0_Cnt16Get(void);             /* 16位计数值获取 */
void     ATIM3_Mode0_Cnt32Set(uint32_t u32Data); /* 32位计数值设置 */
uint32_t ATIM3_Mode0_Cnt32Get(void);             /* 32位计数值获取 */

void ATIM3_Mode0_OutputEnable(void);  /*!< 模式0端口输出使能 */
void ATIM3_Mode0_OutputDisable(void); /*!< 模式0端口输出禁止 */
void ATIM3_Mode0_TOGEnable(void);     /*!< 模式0翻转使能 */
void ATIM3_Mode0_TOGDisable(void);    /*!< 模式0翻转禁止 */
/**
 * @}
 */

/**
 * @addtogroup ATIM3_Global_Functions ATIM3全局函数定义 模式1初始化及相关功能操作
 * @{
 */
void ATIM3_Mode1_Init(stc_atim3_mode1_init_t *pstcCfg);            /* timer配置及初始化 */
void ATIM3_Mode1_InputConfig(stc_atim3_pwc_input_init_t *pstcCfg); /* PWC 输入配置 */
void ATIM3_Mode1_PWCEdgeSelect(uint32_t u32DetectEdgeSel);         /* PWC测量边沿起始结束选择 */

void ATIM3_Mode1_Run(void);  /* timer 启动 */
void ATIM3_Mode1_Stop(void); /* timer 停止 */

void     ATIM3_Mode1_Cnt16Set(uint32_t u16Data); /* 16位计数值设置 */
uint32_t ATIM3_Mode1_Cnt16Get(void);             /* 16位计数值获取 */

uint32_t ATIM3_Mode1_PWCCapValueGet(void); /* 脉冲宽度测量结果数值获取 */
/**
 * @}
 */

/**
 * @addtogroup ATIM3_Global_Functions ATIM3全局函数定义 模式23初始化及相关功能操作
 * @{
 */
void ATIM3_Mode23_Init(stc_atim3_mode23_init_t *pstcCfg); /* timer配置及初始化 */
void ATIM3_Mode23_Run(void);                              /* timer启动/停止 */
void ATIM3_Mode23_Stop(void);                             /* timer启动/停止 */

void ATIM3_Mode23_ManualPWMOutputEnable(void);  /* PWM 手动 输出使能*/
void ATIM3_Mode23_ManualPWMOutputDisable(void); /* PWM 手动 输出禁止 */
void ATIM3_Mode23_AutoPWMOutputEnable(void);    /* PWM 自动 输出使能 */
void ATIM3_Mode23_AutoPWMOutputDisable(void);   /* PWM 自动 输出禁止 */

void     ATIM3_Mode23_ARRBufferEnable(void);    /* 重载值(周期)缓存功能使能*/
void     ATIM3_Mode23_ARRBufferDisable(void);   /* 重载值(周期)缓存功能禁止 */
void     ATIM3_Mode23_ARRSet(uint16_t u16Data); /* 重载值(周期)设置/获取 */
uint32_t ATIM3_Mode23_GetARR(void);
void     ATIM3_Mode23_Cnt16Set(uint16_t u16Data); /* 16位计数值设置/获取 */
uint32_t ATIM3_Mode23_Cnt16Get(void);

void     ATIM3_Mode23_ChannelCompareValueSet(uint32_t u32Channel, uint16_t u16Data); /* 比较捕获寄存器CCRxA/CCRxB/CCR3设置 */
uint32_t ATIM3_Mode23_ChannelCaptureValueGet(uint32_t u32Channel);                   /* 比较捕获寄存器CCRxA/CCRxB/CCR3读取 */
void     ATIM3_Mode23_GateFuncSel(stc_atim3_m23_gate_init_t *pstcCfg);               /* PWM互补输出模式下，GATE功能选择 */

void ATIM3_Mode23_MasterSlaveTrigSet(stc_atim3_m23_master_slave_init_t *pstcCfg); /* 主从触发配置 */
void ATIM3_Mode23_MSCRIA0Sel(uint32_t u32Ia0Sel);                                 /* 主从触发配置 */
void ATIM3_Mode23_MSCRIB0Sel(uint32_t u32Ib0Sel);                                 /* 主从触发配置 */

void ATIM3_Mode23_PortOutputCHxAConfig(uint32_t u32Channel, stc_atim3_m23_compare_init_t *pstcCfg); /* CHxA/CHxB比较输出通道控制 */
void ATIM3_Mode23_PortOutputCHxBConfig(uint32_t u32Channel, stc_atim3_m23_compare_init_t *pstcCfg); /* CHxA/CHxB比较输出通道控制 */
void ATIM3_Mode23_PortInputCHxAConfig(uint32_t u32Channel, stc_atim3_m23_input_init_t *pstcCfg);    /* CH0A/CH0B输入控制 */
void ATIM3_Mode23_PortInputCHxBConfig(uint32_t u32Channel, stc_atim3_m23_input_init_t *pstcCfg);    /* CH0A/CH0B输入控制 */

void ATIM3_Mode23_ETRInputConfig(stc_atim3_m23_etr_input_init_t *pstcCfg);                                    /* ERT输入控制 */
void ATIM3_Mode23_BrakeInputConfig(stc_atim3_m23_bk_input_init_t *pstcBkCfg);                                 /* 刹车BK输入控制 */
void ATIM3_Mode23_BrakePortStatusConfig(uint32_t u32Channel, uint32_t u32ChxaStatus, uint32_t u32ChxbStatus); /* 刹车BK输入控制 */
void ATIM3_Mode23_DTConfig(stc_atim3_m23_dt_init_t *pstcCfg);                                                 /* 死区功能 */
void ATIM3_Mode23_TrigADCConfig(stc_atim3_m23_adc_trig_init_t *pstcCfg);                                      /* 触发ADC控制 */
void ATIM3_Mode23_SetRepeatPeriod(stc_atim3_m23_rcr_init_t *pstcCfg);                                         /* 重复周期设置 */
void ATIM3_Mode23_OCRefClr(stc_atim3_m23_ocref_clr_init_t *pstcCfg);                                          /* OCREF清除功能 */

void ATIM3_Mode23_EnableCH0ASwTrigCaptureCompare(void); /* CHxA/CHxB捕获比较软件触发 */
void ATIM3_Mode23_EnableCH0BSwTrigCaptureCompare(void); /* CHxA/CHxB捕获比较软件触发 */
void ATIM3_Mode23_EnableCH1ASwTrigCaptureCompare(void); /* CHxA/CHxB捕获比较软件触发 */
void ATIM3_Mode23_EnableCH1BSwTrigCaptureCompare(void); /* CHxA/CHxB捕获比较软件触发 */
void ATIM3_Mode23_EnableCH2ASwTrigCaptureCompare(void); /* CHxA/CHxB捕获比较软件触发 */
void ATIM3_Mode23_EnableCH2BSwTrigCaptureCompare(void); /* CHxA/CHxB捕获比较软件触发 */

void ATIM3_Mode23_EnableSoftwareUev(void);   /* 软件更新使能 */
void ATIM3_Mode23_EnableSoftwareTrig(void);  /* 软件触发使能 */
void ATIM3_Mode23_EnableSoftwareBrake(void); /* 软件刹车使能 */
/**
 * @}
 */

/**
 * @addtogroup ATIM3_Global_Functions ATIM3全局函数定义 中断函数相关
 * @{
 */
boolean_t ATIM3_IntFlagGet(uint32_t u32InterruptFlagTypes);    /* 中断标志获取 */
void      ATIM3_IntFlagClear(uint32_t u32InterruptFlagTypes);  /* 中断标志清除 */
void      ATIM3_IntFlagClearAll(void);                         /* 所有中断标志清除 */
void      ATIM3_Mode0_IntEnable(void);                         /* 模式0中断使能 */
void      ATIM3_Mode0_IntDisable(void);                        /* 模式0中断禁止 */
void      ATIM3_Mode1_IntEnable(uint32_t u32InterruptTypes);   /* 模式1中断使能 */
void      ATIM3_Mode1_IntDisable(uint32_t u32InterruptTypes);  /* 模式1中断禁止 */
void      ATIM3_Mode23_IntEnable(uint32_t u32InterruptTypes);  /* 模式23中断使能 */
void      ATIM3_Mode23_IntDisable(uint32_t u32InterruptTypes); /* 模式23中断禁止 */
/**
 * @}
 */

/**
 * @addtogroup ATIM3_Global_Functions ATIM3全局函数定义 结构体初始化函数相关
 * @{
 */
void ATIM3_Mode0_StcInit(stc_atim3_mode0_init_t *pstcInit);   /* 模式0结构体初始化 */
void ATIM3_Mode1_StcInit(stc_atim3_mode1_init_t *pstcInit);   /* 模式1结构体初始化 */
void ATIM3_Mode23_StcInit(stc_atim3_mode23_init_t *pstcInit); /* 模式23结构体初始化 */

void ATIM3_Mode1_InputStcInit(stc_atim3_pwc_input_init_t *pstcCfg);               /*模式1PWC输入配置初始化 */
void ATIM3_Mode23_MasterSlaveStcInit(stc_atim3_m23_master_slave_init_t *pstcCfg); /*模式23 主从触发配置初始化*/
void ATIM3_Mode23_CompareStcInit(stc_atim3_m23_compare_init_t *pstcCfg);          /*模式23 通道0/1/2 CHxB输出设置初始化*/
void ATIM3_Mode23_DTStcInit(stc_atim3_m23_dt_init_t *pstcCfg);                    /*模式23 死区功能初始化*/
void ATIM3_Mode23_ADCTrigStcInit(stc_atim3_m23_adc_trig_init_t *pstcCfg);         /*模式23 触发ADC控制初始化*/
void ATIM3_Mode23_InputStcInit(stc_atim3_m23_input_init_t *pstcCfg);              /*模式23 通道0/1/2 CHxA输入设置初始化*/
void ATIM3_Mode23_BKInputStcInit(stc_atim3_m23_bk_input_init_t *pstcCfg);         /*模式23 刹车BK输入控制初始化*/
void ATIM3_Mode23_RCRStcInit(stc_atim3_m23_rcr_init_t *pstcCfg);                  /*模式23 重复周期设置初始化*/

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __ATIM3_H__ */

/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
